import 'package:flutter/material.dart';

class data
{
  static List category=["शुभकामनाएं शायरी"," दोस्ती शायरी","मजेदार शायरी"," भगवन शायरी","प्रेरणा स्त्रोत शायरी","जीवन शायरी","मोहब्बत शायरी","यादें शायरी","अन्य शायरी","राजनीति शायरी","प्रेम शायरी","दर्द शायरी"," शराब शायरी","बेवफा शायरी","जन्मदिन शायरी","होली शायरी"];

  static List cat_image=['images/8.jpg','images/9.jpg','images/10.jpg','images/11.jpg','images/12.jpg','images/13.jpg','images/14.jpg','images/15.jpg','images/16.jpg','images/17.jpg','images/18.jpg','images/19.jpg','images/20.jpg','images/21.jpg','images/22.jpg','images/23.jpg'];



  static List shubhkamnye=["""मत मुस्कुराओ इतना की फूलो को खबर लग जाये,
          हम करें आपकी तारीफ और आपको नजर लग जाये
          खुदा करे बहुत लम्बी हो आपकी जिंदगी ,
          और उस पर भी हमारी उम्र लग जाये…""",
    """बीते साल को विदा इस तरह करते है.
          जो नहीं किया अब तक वो भी कर गुजरते है.
          नया साल आने के खुशिया तो सब मानते है.
          एक बार हम इते साल कि जस्न मानते है""",
    """हर पल मे खुशी देती है मा,
          अपनी ज़िंदगी से जीवन देती है मा,
          भगवान क्या है!!! मा की पूजा करो जनाब,
          क्यूकी भगवान को भी जनम देती है मा…""",
    """बरसात आये तो ज़मीन गीली न हो,
          धूप आये तो सरसों पीली न हो,
          ए दोस्त तूने यह कैसे सोच लिया कि,
          तेरी याद आये और पलकें गीली न हों।""",
    """हम वो नहीं जो दिल तोड़ देंगे,
          थाम कर हाथ साथ छोड़ देंगे,
          हम दोस्ती करते हैं पानी और मछली की तरह,
          जुदा करना चाहे कोई तो हम दम तोड़ देंगे …""",
    """दिल से निकली हे दुआ हमारी
          जिन्दगी में मिले आपको खुशिया
          गम न दे खुदा आपको कभी
          चाहे तो एक ख़ुशी कम कर ले हमारी""",
    """लोग कहते हैं किसी एक के चले जाने से जिन्दगी अधूरी नहीं होती,
          लेकिन लाखों के मिल जाने से उस एक की कमी पूरी नहीं होती है""",
    """ये रात चाँदनी बनकर आँगन में आये,
          ये तारे लोरी गा कर आपको सुनाएं,
          आयें आपको इतने प्यारे सपने यार...
          कि नींद में भी आप हलके से मुस्कुराएं।""",
    """ईश्वर न करे आपको कोई ग़म हो,
          और सिर्फ खुशियाँ और हँसी मिले,
          ग़म जब भी बढ़ चले आपकी ओर,
          ईश्वर करे रास्ते में उसे पहले हम मिले।"""];

  static List Dosti=["""आसमान से तोड़ कर सितारा दिया है,
          आलम-ए-तन्हाई में एक शरारा दिया है,
          मेरी किस्मत भी नाज़ करती है मुझपे,
          खुदा ने दोस्त ही इतना प्यारा दिया है.""",
    """दोस्ती नाम है सुख-दुःख की कहानी का,
          दोस्ती राज है सदा ही मुस्कुराने का,
          ये कोई पल भर की जान-पहचान नहीं है,
          दोस्ती वादा है उम्र भर साथ निभाने का.""",
    """जो कोई समझ न सके वो बात है हम,
          जो ढल के नई सुबह लाये वो रात हैं हम,
          छोड़ देते हैं लोग रिस्ते बनाकर यूँ ही,
          जो कभी न छूटे ऐसा साथ हैं हम.""",
    """एक जैसे दोस्त सारे नही होते,
          कुछ हमारे होकर भी हमारे नहीं होते,
          आपसे दोस्ती करने के बाद महसूस हुआ,
          कौन कहता है तारे जमीन पर नहीं होते.""",
    """हर नज़र को एक नज़र की तलाश है,
          हर चेहरे में कुछ खास है,
          आपसे दोस्ती हम यू ही नहीं कर बैठे,
          क्या करें हमारी पसंद हे कुछ खास है.""",
    """मिलना बिछड़ना सब किस्मत का खेल है,
          कभी नफरत तो कभी दिलों का मेल है,
          बिक जाता है हर रिस्ता इस जमाने में,
          सिर्फ दोस्ती ही यहाँ नोट फॉर सेल है.""",
    """दोस्ती में दोस्त, दोस्त का ख़ुदा होता है,
          महसूस तब होता है जब वो जुदा होता है."""];

  static List majedar=["""ख्वाब टूटे है मगर हौंसले जिन्दा है,
          हम तो वो है जिन्हें देख के मुश्किलें भी शर्मिंदा है |""",
    """मेरी शराफत को तुम बुझ दिली का नाम मत दो,
          क्यूंकि दबे ने जब तक घोड़ा, तब तक बन्दूक भी खिलौना ही होता है |""",
    """जो गुरुर और रुतबा कल था,
          वो आज भी _हे और आगे भी रहेगा,
          मेरा Attitude कोई Calendar नही
          जो हर साल बदल_जायेगा |""",
    """प्यार तो जिंदगी का एक अफसाना है,
          इसका अपना ही एक तराना है,
          सबको मालूम है कि मिलेंगे सिर्फ आंसू
          पर न जाने क्यों, दुनियां में हर कोई इसका दीवाना है.""",
    """इंसान बुरा तब बनता है जब 
          उसकी अच्छाई का बहुत से लोगो ने 
          नाजायज फायदा उठाया हो""",
    """उन्होंने आज हम पर तिरछी नज़र डाली तो हम मदहोश हो गए
          बाद में पता चला नजर ही तिरछी है
          तो हम बेहोश हो गए""",
    """तेरे प्यार की रौशनी ऐसी है कि
          हर तरफ़ उजाला नजर आता है
          सोचता हूँ घर की बिजली कटवा दुँ
          क्योंकि बिल बहुत आता है""",
    """आधियों से कहो औकात में रहें
          यहाँ जरा सा तार हिल जाने से
          बिज़ली चली जाती है""",
    """चिरागों में इतना नूर ना होता,
          तो तनहा दिल मजबूर ना होता,
          हम आपसे मिलने जरूर आते,
          अगर आपका घर इतना दूर ना होता।""",
    """ये बारिश का मौसम बहुत तड़पाता है,
          वो बस मुझे ही दिल से चाहता है,
          लेकिन वो मिलने आए भी तो कैसे…?
          उनके पास फटा हुआ छाता है........!!!!! """,
    """आँखों से आसुओं की विदाई कर दो,
          दिल से ग़मों की जुदाई कर दो,
          अगर फिर भी दिल न लगे कही,
          तो मेरे घर की पुताई कर दो…।"""];

  static List bhagavan=["""जो लोग ईश्वर को पाना चाहते हैं,
          उन्हें वाणी, मन, इंद्रियों की पवित्रता और
          एक दयालु हृदय की जरूरत होती हैं।""",
    """साधू बने तो मोहमाया छूटे,
          वैरागी बने तो छूटे तन,
          हरि तेरे से सच्चा प्रेम हो जाए तो
          तभी छूटे सारे मोह माया के बंधन।""",
    """शिव की ज्योति से प्रकाश बढ़ता है।
          जो भी जाता है भोले के द्वार।
          कुछ न कुछ उसे जरुर मिलता है।""",
    """मुझे आप मिल गये ईश्वर
          सहारा हो तो ऐसा हो
          जिधर देखू उधर तूम हो
          नजारा हो तो ऐसा हो।""",
    """जीवन रुपी जहाज के है हम खिवैया
          अगर तूफ़ान में डूबने लगे आपकी नैया
          दोस्त डरना मत,
          बेड़ा पार लगाएगा कृष्ण कन्हैया।""",
    """ईश्वर के नाम दिया कभी अल्प नही होता
          जो टूट जाए वो दृढ संकल्प नही होता
          हार को जीत से दूर ही रखना
          क्योकि जीत का कोई विकल्प नही होता।""",
    """महादेव” आप पर क्या लिखूं! कितना लिखूं!
          रहोगे आप फिर भी अपरिभाषित चाहे जितना लिखूं!""",
    """इस जहाँ के कानून से शिकायत मत करना
          अपनी नजरों को कभी शर्मिंदा न करना
          ईश्वर सब कुछ देगा आपकों
          वक्त से पूर्व पुकार मत करना।"""];

  static List prerna=["""कोन जाने कब मौत का पैगाम आ जाए,
          ज़िंदगी की आखरी शाम आ जाए,
          हमे तो इंतजार है उस शाम का
          जब हमारी ज़िंदगी किसी के काम आ जाए.""",
    """उठा कर तलवार जब घोड़े पे सवार होते
          बाँध के साफ़ा जब तैयार होते
          देखती है दुनिया छत पे चढ़के
          कहते है की काश हम भी ऐसे होशियार होता""",
    """सफ़र ज़िंदगी का बहुत ही हसीन है
          सभी को किसी न किसी की तलाश हैं
          किसी के पास मंज़िल हैं तो राह नही
          और जिसके पास राह हें तो मंज़िल नही""",
    """खुद को ख़ुदा कहा और खुद ही ख़ुदा हो गए,
          रिश्तों की कशमकश में खुद से जुदा हो गए !
          बांचते रहे तमाम उम्र आईने में अपनी सूरत,
          तन्हा रहे जिंदगी में और भीड़ में ही खो गए""",
    """बैठे बैठे ज़िन्दगी बरबाद ना की जिए,
          ज़िन्दगी मिलती है कुछ कर दिखाने के लिए,
          रोके अगर आसमान हमारे रस्ते को,
          तो तैयार हो जाओ आसमान झुकाने के लिए""",
    """मोहब्बत भी अजीब चीज़ बनाई तूने,
          तेरी ही मस्ज़िद मे, तेरे ही मंदिर मे,
          तेरे ही बंदे, तेरे ही सामने रोते हे,
          पर तुजे नही, किसी ओर को पाने के लिए""",
    """सफ़र ज़िंदगी का बहुत ही हसीन है
          सभी को किसी न किसी की तलाश हैं
          किसी के पास मंज़िल हैं तो राह नही
          और जिसके पास राह हें तो मंज़िल नही"""];

  static List jivan=["""ज़िन्दगी के सफ़र में
          मुसाफिर चलता गया
          जैसा रब ने चाहा
          वैसा सफर कटता गया
          मुसाफिर आगे बढ़ते रहे
          और मंज़िल का रास्ता घटता गया""",
    """ज़िन्दगी भर हम खुशियां ढूंढते रह गए
          बहार खुशी को ढूंढना के चक्कर में
          हम अपने अंदर की खुशी से वंचित रह गए""",
    """कुछ कही, कुछ अनकही
          कुछ ख्वाहिशें मेरी
          ज़िन्दगी भर अधुरी रही""",
    """कुछ ऐसे हालात हुए,
          हम इतने मजबुर हो गए
          बेवफा नहीं थे हम
          फिर भी अपनी चाहत से दूर हो गए""",
    """ज़िन्दगी की दौलत को यूं ही मत गंवाना
          यह जिंदगी जीने के लिए मिली है
          काटने के लिए नहीं""",
    """जीना है तो खुल कर जिओ
          घुट-घुट कर नहीं
          ये ज़िन्दगी जीने के लिए मिली है
          पल-पल मरने के लिए नहीं""",
    """जी लेंगे ज़िन्दगी हम
          बस कुछ हसरतें पूरी हो जाए
          एक दिन चले जाएंगे हम
          सब छोड़कर
          बस उम्र पूरी हो जाए""",
    """मेरे जाने के बाद
          तुम मेरा इंतजार मत करना
          जिंदगी रही तो फिर मिलूंगा
          तुम जिंदगी का ऐतबार मत करना""",
    """कितनी तन्हाई है ज़िन्दगी में तुम्हारे बिना
          तुम आकर इसे महफ़िल कर दो
          बेरंग सी मेरी ज़िन्दगी में
          रंग ही रंग भर दो"""];

  static List mohabbat=["""प्यार इतना हो गया तुमसे
          कि जीने के लिए सांसो की नही
          हमे तुम्हारी जरूरत है.!!""",
    """बिन बोले हर बात समझ जाते हो
          हाय मेरी जान
          मुझे तुम कितना चाहते हो.!!""",
    """मुमकिन नही कि किसी
          और से दिल लगा ले हम
          ये दिल धड़कता भी है
          तो सिर्फ तुम्हारे नाम से..!""",
    """मेरी मोहब्बत का
          बस इतना सा फ़साना है
          एक मेरा दिल है और
          उसमें तुम्हे बसाना है..!""",
    """देख कर मुझको दूर से ही
          वो मुस्कुराने लगे अब तो वो
          भी हमसे इश्क फरमाने लगे..!""",
    """मुझे अब जरूरत नही
          किसी और के इश्क की
          तुम्हारी यादे मुझे
          इस कदर सताती है..!""",
    """ये बारिश की बूंदे
          मुझे भी खूबसूरत लगती है
          मन करता है संग तुम्हारे
          बारिश की बूंदों में भीगता जाऊं..!""",
    """अगर चाहो किसी को पूरी शिद्दत से
          तो कायनात भी झुकती है
          सच्ची मोहब्बत के आगे
          जमाने की कहां चलती है..!""",
    """इश्क मेरा मुकम्मल नही है
          मगर आज भी तुमसे
          मोहब्बत बेइंतहा है..!""",
    """मोहब्बत तो की थी हमने लेकिन
          यह सोच कर भुला दिया कि
          अभी घर की जिम्मेदारी बहुत है..!"""];

  static List yaadein=["""कभी कभी किसी अपने की इतनी 
          याद आती है की रोने के लिए 
          रात भी कम पड़ जाती है !!""",
    """न जाने क्यों जिंदगी काँटे की तरह चुभ 
          रही है , तेरी हर एक बात अब 
          बहुत याद आ रही है !!""",
    """दिल की हालात किसी से कही नही जाती ,
          हमसे उनकी चाहत छुपाई नही जाती ,
          बस एक याद बची है उनके चले 
          जाने के बाद ,वो भी दिल से 
          मिटायी नही जाती !!""",
    """उम्र के राह में रास्ते बदल जाते है ,वक्त की आंधी 
          में इंसान बदल जाते है ,सोचते है तुम्हें इतना 
          याद ना करे लेकिन आँख बंद करते 
          ही इरादे बदल जाते है !!""",
    """दूर रहते है मगर दिल से दुआ करते है हम , प्यार 
          का फ़र्ज़ अदा करते है हम , आपकी याद सदा 
          साथ रखते है हम , दिन हो या रात आपको 
          ही याद करते है हम !!""",
    """अब तो तुम्हारी यादें भी आँखों तक आती है , 
          बस थोड़ी देर ठहरती है , फ़िर बूंदे बन 
          के गिर जाती है !!""",
    """दुनिया की कभी ना परवाह करना दिल से ना कभी 
          हमें जुदा करना , जब आए तुम्हें याद हमारी 
          तो बस मिलने की दुआ करना !!!""",
    """हिचकियों को मत भेजो अपना मुखबिर बना के 
          हमें और भी काम है तुम्हें याद करने 
          के सिवा  !!""",
    """तुम्हारीं याद मुझे बेचैन कर जाती है ,
           हर जगह मुझे बस तुम्हारी ही सूरत नजर आती है ,
           जाने कैसा कर दिया है मुझे तुम्हारी मोहब्बत ने ,
          अगर कभी नींद आती है तो आँखे रूठ जाती है !!""",
    """हर पल की ख़ुशी आपके हाथ में है ,
           हमारी हर हँसी आपके साथ में है ,
           दूर रहकर भी आपको याद करते है ,
          ज़रूर कोई प्यारी सी अदा आप में है !!""",
    """क्या बयान करूँ मैं की मेरी हालत क्या हो जाती है ,
          शाम ढले जब उसकी यादें मेरे बिस्तर पर आ 
          जाती है , भीग जाती है पलकें और होठ 
          सुख जाते है , सोने नही देती है फ़िर 
          सारी रात जगाती है !!"""];

  static List anya=["""जो हौंसले के तीर तुमने तरकश में सजाये, 
          उन्हें अपनी मेहनत के धनुष
           से चलाकर धनुर्धर बनो।""",
    """किसी के हाथों की कठपुतली 
          बन कर मत नाच,
           कुछ ऐसा कर की दुनिया
           तुम्हारे इशारों पर नाचे""",
    """जैसे फूलों को धागे में पिरो
           कर माला बनती है,
           वैसे ही शब्दों को अहसासों में पिरों
           कर कविता बनती है,
           ठीक वैसे ही सपनों को मेहनत 
          में पिरो कर कामयाबी मिलती है।""",
    """"तू जो पास थी, तो तेरी कद्र जरा कम थी। 
          मेरी गलतियों का पता कैसे चलता मुझे,
           तूने कभी शिकायत ही नहीं की।""",
    """शायरी लिखना उन्होंने शुरू किया,
           हमें तो कविताओं का शौक था। 
          कलाकार वो खुद को कहते थे,
           हमे तो उनकी कलाओं का शौक था।""",
    """ये आग कि लिपटें,
           ये धुआं और धुएँ से बना
           काजल सब अनायास लगते हैं,
           मुझे जो कभी उसके सजावट
           का समान होते थे।""",
    """वो कहता है मुझे और मैं
           उसे सुनता रहता हूँ,
           मैं चाँद हूँ उसका और
           वो मेरी चान्दनी,
           यही कहता रहता है वो।"""];

  static List<Color> myclr=[
      Colors.indigo,
    Colors.blue,
    Colors.cyanAccent,
    Colors.green,
    Colors.teal,
    Colors.limeAccent,
    Colors.brown,
    Colors.deepOrange,
  ];

  static List<Color> color=[
    Colors.brown,
    Colors.white,
    Colors.black,
    Colors.red,
    Colors.tealAccent,
    Colors.redAccent,
    Colors.orangeAccent,
    Colors.limeAccent,
    Colors.lightBlue,
    Colors.deepOrangeAccent,
    Colors.indigoAccent,
    Colors.purple,
    Colors.amber,
    Colors.blueGrey,
    Colors.pink,
    Colors.teal,
    Colors.green,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.deepPurple,
    Colors.greenAccent,
    Colors.pinkAccent,
    Colors.cyanAccent,
    Colors.yellow,
    Colors.orange,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.deepPurple,
    Colors.greenAccent,
    Colors.pinkAccent,
    Colors.cyanAccent,
    Colors.yellow,
    Colors.orange,
  ];

  static List<Color> textclr=[
    Colors.brown,
    Colors.white,
    Colors.black,
    Colors.red,
    Colors.tealAccent,
    Colors.redAccent,
    Colors.orangeAccent,
    Colors.limeAccent,
    Colors.lightBlue,
    Colors.deepOrangeAccent,
    Colors.indigoAccent,
    Colors.purple,
    Colors.amber,
    Colors.blueGrey,
    Colors.pink,
    Colors.teal,
    Colors.green,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.deepPurple,
    Colors.greenAccent,
    Colors.pinkAccent,
    Colors.cyanAccent,
    Colors.yellow,
    Colors.orange,
    Colors.blue,
    Colors.lightGreenAccent,
    Colors.deepPurple,
    Colors.greenAccent,
    Colors.pinkAccent,
    Colors.cyanAccent,
    Colors.yellow,
    Colors.orange,
  ];

   static List emoji=[
    "🌷🍀🌸🥀🌻🌴🌹🌹",
    "😊😍😊💐👫😎🙂",
    "😂🤣☺😊🥳💐🌹🌾🌺🍃",
    "🌹🌿🌱😍🥰😘😊",
    "🌴🌳🍀🍁🌻🌼🌲🌳",
    "🌷🍀🌸🥀🌻🌴🌹🌹",
    "☺😊😇🌻🌴🌹🙂😍🥰",
    "🌷🍀🌸🥀🌻🌴🌹🌹",
    "😊😍😊💐👫😎🙂",
    "😂🤣☺😊🥳💐🌹🌾🌺🍃",
    "🌹🌿🌱😍🥰😘😊",
    "🌴🌳🍀🍁🌻🌼🌲🌳",
    "🌷🍀🌸🥀🌻🌴🌹🌹",
    "☺😊😇🌻🌴🌹🙂😍🥰",
    "😊😍😊💐👫😎🙂",
    "😂🤣☺😊🥳💐🌹🌾🌺🍃",
    "🌹🌿🌱😍🥰😘😊",
    "🌴🌳🍀🍁🌻🌼🌲🌳",
    "🌷🍀🌸🥀🌻🌴🌹🌹",
    "☺😊😇🌻🌴🌹🙂😍🥰"
  ];

   static List font=[
     "f1",
     "f2",
     "f3",
     "f4",
     "f5",
     "f6",


   ];
}
